---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.ServerGUID
source: html/4d2efd1b-db55-26f3-c30f-51de2ed545ca.htm
---
# Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.ServerGUID Property

The GUID of the pipe fitting or pipe accessory.

## Syntax (C#)
```csharp
public Guid ServerGUID { get; }
```